package io.ylab.lesson1.javaRashTasks.level1;
//Уровень 1 6. Заключение контракта
public class Task3 {

    //Задание: вывести на экран текст
    public void printText() {
        System.out.println("Меня зовут Амиго.");
        System.out.println();
        System.out.println("Я согласен на зарплату $10/месяц в первый год.");
        System.out.println("Я согласен на зарплату $20/месяц во второй год.");
        System.out.println("Я согласен на зарплату $30/месяц в третий год.");
        System.out.println("Я согласен на зарплату $40/месяц в четвертый год.");
        System.out.println("Я согласен на зарплату $50/месяц в пятый год.");
        System.out.println();
        System.out.println("Спасибо за щедрость, друг Риша!");
    }

    //Новое задание: написать программу, которая выводит на экран строки:
    public void printNewText() {
        System.out.println("Меня зовут Амиго.");
        System.out.println();
        System.out.println("Я согласен на зарплату $800/месяц в первый год.");
        System.out.println("Я согласен на зарплату $1500/месяц во второй год.");
        System.out.println("Я согласен на зарплату $2200/месяц в третий год.");
        System.out.println("Я согласен на зарплату $2700/месяц в четвертый год.");
        System.out.println("Я согласен на зарплату $3200/месяц в пятый год.");
        System.out.println();
        System.out.println("Поцелуй мой блестящий металлический зад!");
    }
}
